app/controllers/orders_controller.rb

  def index
    #@orders = Order.all
    @user=current_user
    @orders = Order.where(:user_id => @user.id)
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 1